{
  "stories": [
    {
      "story_title": "The Crows in The Kingdom",
      "story_description": "On one fine sunny day, Akbar and Birbal were taking a leisurely walk in the palace gardens. Suddenly, Akbar thought of testing Birbal’s wits by asking him a tricky question.\n\nEmperor asked Birbal, “How many crows are there in our kingdom?” Birbal could sense the amusement in the king’s voice, and within a few minutes Birbal replied, “My king, there are eighty thousand nine hundred and seventy-one crows in our kingdom”.\n\nSurprised and amazed, Akbar further tested Birbal, “What if we have more crows?” Birbal replied, “Oh, then the crows from the other kingdoms must be visiting us’’.\n\n“What if there are lesser crows?” asked Akbar. “Well, then some of our crows must be visiting other kingdoms”, replied Birbal with a grin on his face.\n\nAkbar smiled at Birbal’s great sense of humour and wit.",
      "story_name": "The Crows in The Kingdom",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fakbar_birbal%2Fcrows.jpeg?alt=media&token=09021cc4-08b1-423f-bdb3-cb607523354c"
    },
    {
      "story_title": "The Challenge of Cold Water",
      "story_description": "Once on a cold winter day, Akbar and Birbal were walking by a lake. Akbar stopped and put his finger into the freezing water and immediately took it out saying, “I don’t think anyone can sustain a night in this cold water”. Birbal took that as a challenge and said that he would find someone who can do it. Akbar promised a sum of 1000 gold coins to whoever could spend a night standing in the cold water of the lake. Soon, Birbal found a poor man who agreed to undertake the challenge for the 1000 gold coins. Guarded by two royal guards, the poor man spent the entire night standing in the freezing water.\n\n In the morning, the poor man was taken to court for the reward. On being asked by the king how he could stand in freezing water, the man replied, “My lord, I kept looking at a lamp that was burning at a distance, and spent my entire night looking at it”. On learning this, the emperor said, “This man is not worthy of the reward as he could manage to stand in the lake because he was getting warmth from the lamp”. The poor man felt doomed and heart-broken. He reached out to Birbal for help. Birbal didn’t go to the court the next day. Akbar visited Birbal to find the reason. To his amusement, the King found Birbal sitting beside the fire with a pot hanging almost 6 feet above it. On being enquired, Birbal said, “I am cooking khichadi, my lord”. Akbar started laughing and said that was impossible. Birbal said, “It is possible my King. If a poor man can stay warm by simply looking at the lamp burning at a distance, I can cook this khichadi the same way.” Akbar understood Birbal’s point and rewarded the poor man for completing the challenge.",
      "story_name": "The Challenge of Cold Water",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fakbar_birbal%2Fcold.jpeg?alt=media&token=9d9d6ca9-96d9-49e4-8bc4-a107be1a9ef4"
    },
    {
      "story_title": "The Mystery of the Robbery",
      "story_description": "Once upon a time, a rich merchant was robbed in King Akbar’s kingdom. The grief-stricken merchant went to the court and asked for help. Akbar asked Birbal to help the merchant find the robber. The merchant told Birbal that he was suspicious of one of his servants. On getting the hint from the merchant, Birbal summoned all the servants and told them to stand in a straight line. When asked about the robbery, everyone denied doing it, as expected. Birbal then handed over one stick of the same length, to each one of them. While dispersing, Birbal said, “By tomorrow, the robber’s stick will increase by two inches”. The next day when Birbal summoned everyone and inspected their sticks, one servant’s stick was shorter by two inches. On being asked by the merchant about the mystery of finding the real thief, Birbal said, “It was simple: the thief had cut his stick by two inches, fearing that it would increase in size”.",
      "story_name": "The Mystery of the Robbery",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fakbar_birbal%2Froberry.jpeg?alt=media&token=c5c0f02e-8591-4ccf-a064-8a6a94fc7410"
    },
    {
      "story_title": "The Lost Ring",
      "story_description": "Once upon a time, King Akbar lost a ring that was very precious to him. This ring was a gift from his father and losing it made the king very sad. Akbar summoned Birbal and requested him to find the ring. The court was full of courtiers. Birbal announced, “My great king, the ring is right here in the courtroom, and the one who has the ring has a straw stuck in his beard.” Everyone started looking at each other, and one of the courtiers started touching his beard to find the straw. Birbal called the guards and asked them to search the suspect. On searching the suspect, the ring was retrieved. Akbar was amazed at how Birbal managed to find the ring. Birbal said, “My King, the one who is guilty will always feel scared”.",
      "story_name": "The Lost Ring",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fakbar_birbal%2Fring.jpeg?alt=media&token=81329c10-d0da-4135-a60c-1427fc59c5e5"
    },
    {
      "story_title": "The Clever Well Seller",
      "story_description": "Once upon a time, a clever man sold his well to a farmer. The next day, when the farmer went to the well to fetch some water, the man said that he only sold the well and not its water. The farmer did not know what to do, and with a sad heart, he went to Akbar’s court. Birbal was told to take care of the case. The following day, the man who sold the well along with the farmer was called to the court. The clever man made the same statement – he had sold his well, not the water in it. On learning this, Birbal said, “My friend, in that case, you either remove your water from the well or pay tax for your water because it is the farmer’s well.” The man realised his mistake and asked for forgiveness as he felt helpless and outwitted.",
      "story_name": "The Clever Well Seller",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fakbar_birbal%2Fwell.jpeg?alt=media&token=ffe20807-34ab-4eba-a9b5-e76483242208"
    },
    {
      "story_title": "Birbal's Wit",
      "story_description": "Once upon a time, king Akbar got so mad at Birbal that he told Birbal to leave the kingdom and go away. Heartbroken, Birbal left the kingdom and took refuge at a farmer’s house in a nearby village. Birbal spent his days working at the farm. As time passed, King Akbar started missing his favourite courtier. One day, Akbar decided to send across his royal guards to find Birbal. The guards looked for Birbal in all directions, but all their efforts went to waste. Akbar thought of a trick to find Birbal – he made an announcement that whoever got him a pot full of wit would be given a pot filled with diamonds. The news reached all the nearby villages, and to Birbal as well. The villagers held a meeting to decide how to solve the king’s mystery. Birbal offered to help, stating that he needs a month’s time. Birbal took a pot and put a small watermelon in it without cutting it from its vines. After a month, the watermelon grew up to the size of the pot. This pot was sent to the King, and he was told that the wit should only be removed without breaking the pot. Akbar knew that this could be no one else but Birbal, and he went to bring Birbal back to his court.",
      "story_name": "Birbal's Wit",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fakbar_birbal%2Fwatermelon.jpeg?alt=media&token=df317a55-8a6d-47aa-bd69-31280be6f1f8"
    },
    {
      "story_title": "Birbal's Wit Challenge",
      "story_description": "The tales of Birbal’s unparalleled wit and wisdom had reached faraway lands. Once a scholar visited Akbar’s court with the thought of challenging Birbal’s intelligence. The scholar told the king that he is the smartest and even Birbal would not be able to answer his questions. Akbar called Birbal to the court and told him what the scholar claimed. Birbal accepted the challenge that the scholar had posed for him. The scholar asked Birbal, “Do you want to answer a hundred easy questions or one difficult question?” Birbal said that he wanted to answer the difficult one. The scholar said, “Tell me Birbal, what came first, the chicken or the egg?” Birbal thought for a while and said, “Chicken came first”. The scholar mocked Birbal and said, “How can you be sure?” Birbal immediately replied, “I had only promised to answer one question, and therefore, I will not reply”. The scholar felt ashamed of his claim and left with a heavy heart.",
      "story_name": "Birbal's Wit Challenge",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fakbar_birbal%2Fab_3.jpeg?alt=media&token=13f27d40-cb52-4c76-ad46-6b4e36abcc94"
    },
    {
      "story_title": "Akbar's Egg Trick",
      "story_description": "Once King Akbar thought of playing a trick on his favourite minister, Birbal. He confided in all other ministers and shared his plan with them. As per the plan, all the ministers had to carry an egg each the following day, hidden inside their robes. The next day, Akbar told his courtiers that he had a dream – according to it, if the ministers fetch an egg each from the royal pond, it will prove their loyalty towards him. After narrating his dream, Akbar asked all his ministers to do the same and show him their loyalty. As planned, all the ministers pretended to look for the eggs, and within no time all of them returned an egg each that was already hidden inside their robes. Birbal kept looking for the egg, but couldn’t find any. When Birbal reached empty-handed, everyone sneered at him, and they were smiling at each other. Birbal could gauge the entire scenario and went up to the king and made the loud rooster-sounds. The King was perplexed and asked Birbal why he did so, upon which Birbal replied, “My King, I am not a hen, and therefore, I could not fetch you any eggs; but I am a rooster, and this is what I can do best”. Listening to this, everyone burst into a hearty laugh.",
      "story_name": "Akbar's Egg Trick",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fakbar_birbal%2Fakbar_eggs.jpeg?alt=media&token=a143303c-c032-4211-a1ab-4bff86c9dac2"
    },
    {
      "story_title": "Birbal's Ambassadorship",
      "story_description": "Once Birbal was sent as an ambassador to another kingdom. The King of that kingdom had also heard stories about Birbal’s sharp intellect and wanted to test the same. The King made all his ministers dress up like him, and they all sat in a line to test Birbal. When Birbal entered the courtroom, he was amazed to see everyone dressed in the same clothes and sitting on a similar kind of throne. Perplexed, Birbal took a moment to observe everyone and then went up to one of them and bowed in front of him. It was the King himself, who then was surprised beyond words. He stood up and hugged Birbal and also asked him how he could guess so. Birbal smiled and answered, “My lord, the kind of confidence you exuded, no one else did, and they also kept looking at you for approval”. The King felt amused and praised Birbal for his unmatched intellect and presence of mind.",
      "story_name": "Birbal's Ambassadorship",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fakbar_birbal%2Fab_forest.jpeg?alt=media&token=5760990e-931d-4f3d-9fd2-6ef26cd479f1"
    },
    {
      "story_title": "Birbal's Choice",
      "story_description": "Just like any other day in King Akbar’s court, once Akbar asked Birbal, “My dear Birbal if I tell you to choose between justice and a gold coin, what will you choose?” Without taking long to answer, Birbal replied, “My lord, I will choose a gold coin, without a doubt”. Everyone including king Akbar was aghast at Birbal’s instant reply and thought that this time Birbal had fumbled for once. King Akbar said, “I am very disappointed in you. Why would you choose something of lesser value like a gold coin over something as valuable as justice?” Birbal replied with a grin on his face, “My kind King, there is no dearth of justice because there is justice everywhere in your kingdom. I felt no need to ask something that I have in abundance but my lord, I surely fall short of money, and a gold coin would be nice”. Listening to this reply, Akbar was speechless, but he had a big smile on his face. He felt overjoyed with the reply and rewarded Birbal with 100 gold coins.",
      "story_name": "Birbal's Choice",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fakbar_birbal%2Fab_2.jpeg?alt=media&token=a590850e-5cbc-4dda-bfe0-466b4339a25e"
    },
    {
      "story_title": "The Mango Tree Dispute",
      "story_description": "Once, two brothers, Ram and Sham, were fighting over the ownership of a Mango Tree. Ram said the Mango tree was his; while Sham said he owned it. Unable to find a way out, they decided to ask Birbal for help. Birbal analysed the situation and told the brothers to remove all the mangoes, share them between the two brothers, then cut the tree in two equal halves. Upon hearing Birbal, Ram nodded, while Sham pleaded not to cut the tree for he had nurtured it for three whole years. Birbal found who the real owner of the tree was. He said, “The tree belongs to Sham because the very thought of cutting it down troubled him. Someone who has cared for it for three years won’t cut it down immediately.”",
      "story_name": "The Mango Tree Dispute",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fakbar_birbal%2Fmango.jpeg?alt=media&token=11819769-8146-4245-9559-642b4d37a4f4"
    },
    {
      "story_title": "The Brahmin's Pumpkin",
      "story_description": "A Brahmin found a pumpkin in his field and decided to take it to Akbar as a gift. On the way, he met Birbal, who asked him why he was carrying such a heavy load. The Brahmin boasted that he was taking a priceless diamond to Akbar. When he finally reached the court, Akbar asked him to cut the pumpkin in half. The Brahmin was shocked to find it was just a pumpkin. Birbal explained that lying and boasting brings nothing but embarrassment.",
      "story_name": "The Brahmin's Pumpkin",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fakbar_birbal%2Fpumpkin.jpeg?alt=media&token=47736634-1a5c-4ad8-86fd-7f36b36234bb"
    }
  ]
}
