{
  "stories": [
    {
      "story_title": "The Merchant and the Magic Lamp",
      "story_description": "Once upon a time, in the bustling markets of Baghdad, there lived a merchant named Ali. Ali was known far and wide for his shrewd business sense and his knack for finding rare treasures from distant lands. One day, while browsing through an old shop, Ali stumbled upon a dusty lamp tucked away in a forgotten corner.\n\nCurious, Ali picked up the lamp and gave it a gentle rub to clean off the grime. To his astonishment, a cloud of smoke billowed from the lamp, and a magical genie appeared before him.\n\n\"Thank you for releasing me, O noble merchant!\" exclaimed the genie. \"As a token of gratitude, I grant you three wishes.\"\n\nAli was overjoyed at his unexpected fortune. He pondered his wishes carefully, knowing that they could change his life forever. After much thought, he made his first wish.\n\n\"I wish for a bag of gold coins that never runs out,\" Ali declared.\n\nInstantly, a shimmering bag filled with gold coins materialized before him. Ali's eyes widened in amazement as he realized the power of the genie's magic.\n\nFor his second wish, Ali wished for a grand palace filled with riches and luxuries beyond imagination. Once again, the genie granted his wish without hesitation, and Ali found himself standing in front of a magnificent palace fit for a king.\n\nWith one wish left, Ali contemplated how he could use it wisely. Then, an idea struck him.\n\n\"I wish for the wisdom to make the best decisions in life,\" Ali said earnestly.\n\nThe genie smiled and granted Ali's final wish. From that moment on, Ali possessed a keen insight and a deep understanding of the world around him.\n\nYears passed, and Ali's wealth and wisdom made him a respected figure in the kingdom. He used his riches to help the poor and support worthy causes, earning the love and admiration of the people.\n\nAs for the magic lamp, Ali kept it safe as a reminder of the incredible journey that had changed his life forever.\n\nAnd so, the tale of Ali and the magic lamp became a legendary story told throughout the land, inspiring others to dream big and believe in the power of fate.",
      "story_name": "The Merchant and the Magic Lamp",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Farabian%20nights%2Flamp.jpeg?alt=media&token=99f75b68-43d1-4661-9e33-46dd926748dc"
    },
    {
      "story_title": "The Enchanted Carpet",
      "story_description": "In the bustling city of Damascus, there lived a young merchant named Ahmad. Ahmad was known for his adventurous spirit and love for exploring distant lands. One day, while browsing through an old market, Ahmad stumbled upon a mysterious carpet that caught his eye.\n\nThe carpet was unlike any he had ever seen before. It shimmered with magical patterns and exuded an aura of enchantment. Intrigued, Ahmad approached the carpet and touched its intricate designs.\n\nTo his amazement, the carpet came to life! It unfurled itself and floated gently in the air, beckoning Ahmad to embark on a journey.\n\nWithout hesitation, Ahmad climbed onto the enchanted carpet, and with a gentle command, it soared into the sky, carrying him far away from the bustling city.\n\nAs Ahmad traveled on the magical carpet, he marveled at the sights below. He flew over vast deserts, majestic mountains, and sparkling rivers. The wind whispered ancient secrets, and the stars above seemed to guide his path.\n\nAfter many days of wondrous travel, Ahmad arrived at a hidden oasis nestled among the dunes. There, he met a wise old sage who welcomed him warmly.\n\nThe sage revealed that the enchanted carpet was a gift from the Djinn of the Winds, bestowed upon those with pure hearts and a thirst for adventure.\n\nAmazed by the carpet's magic and grateful for the opportunity it had given him, Ahmad decided to stay at the oasis for a while, learning from the sage's wisdom and enjoying the tranquility of the desert.\n\nYears passed, and Ahmad became known as a great storyteller, regaling travelers with tales of his adventures on the enchanted carpet. People from far and wide would gather to listen, and his stories inspired many to seek their own paths of discovery.\n\nAnd so, the tale of Ahmad and the enchanted carpet lived on, weaving dreams and enchantment into the hearts of all who heard it.",
      "story_name": "The Enchanted Carpet",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Farabian%20nights%2Fcarpet.jpeg?alt=media&token=69d900e6-5d75-4bee-8aca-63b20cdd55f7"
    },
    {
      "story_title": "Ali Baba and the Forty Thieves : Part 1",
      "story_description": "In a town in Persia there dwelled two brothers, one named Cassim, the other Ali Baba. Cassim was married to a rich wife and lived in plenty; while Ali Baba had to maintain his wife and children by cutting wood in a neighbouring forest and selling it in the town. One day, when Ali Baba was in the forest, he saw a troop of men on horseback, coming toward him in a cloud of dust. He was afraid they were robbers, and climbed into a tree for safety. When they came up to him and dismounted, he counted forty of them. They unbridled their horses and tied them to trees. The finest man among them, whom Ali Baba took to be their captain, went a little way among some bushes, and said: “Open Sesame!” so plainly that Ali Baba heard him. A door opened in the rocks, and having made the troop go in, he followed them, and the door shut again of itself. They stayed some time inside, and Ali Baba, fearing they might come out and catch him, was forced to sit patiently in the tree. At last the door opened again, and the forty thieves came out. As the captain went in last, he came out first, and made them all pass by him. He then closed the door, saying, “Shut Sesame!” Every man bridled his horse and mounted. The captain put himself at their head, and they returned as they came.\nThen Ali Baba climbed down and went to the door concealed among the bushes, and said: “Open Sesame!” It flew open. Ali Baba, who expected a dull, dismal place, was greatly surprised to find it large and well lighted, hollowed by the hand of man in the form of a vault, which received the light from an opening in the ceiling. He saw rich bales of merchandise – silk brocades, all piled together, and gold and silver in heaps, and money in leather purses. He went in and the door shut behind him. He did not look at the silver, but brought out as many bags of gold as he thought his asses, which were browsing outside, could carry. He loaded them with the bags, and hid it all with fagots. Using the words: “Shut Sesame!” he closed the door and went home.\nThen he drove his asses into the yard, shut the gates, carried the money-bags to his wife, and emptied them out before her. He bade her to keep the secret, and he would go and bury the gold. “Let me first measure it,” said his wife. “I will go and borrow a measure off someone, while you dig the hole.” So she ran to the wife of Cassim and borrowed a measure. Knowing Ali Baba’s poverty, the sister was curious to find out what sort of grain his wife wished to measure, and artfully put some suet at the bottom of the measure. Ali Baba’s wife went home and set the measure on the heap of gold, and filled it and emptied it often, to her great content. She then carried it back to her sister, without noticing that a piece of gold was sticking to it, which Cassim’s wife perceived directly whilst her back was turned. She grew very curious, and said to Cassim when he came home: “Cassim, your brother is richer than you. He does not count his money, he measures it.” He begged her to explain this riddle, which she did by showing him the piece of money and telling him where she found it. Then Cassim grew so envious that he could not sleep, and went to his brother in the morning before sunrise. “Ali Baba,” he said, showing him the gold piece, “you pretend to be poor and yet you measure gold.” By this Ali Baba perceived that through his wife’s folly Cassim and his wife knew their secret, so he confessed all and offered Cassim a share. “That I expect,” said Cassim, “but I must know where to find the treasure, otherwise I will discover all, and you will lose all.” Ali Baba, more out of kindness than fear, told him of the cave, and the very words to use. Cassim left Ali Baba, meaning to be beforehand with him and get the treasure for himself. He rose early next morning, and set out with ten mules loaded with great chests. He soon found the place, and the door in the rock. He said: “Open Sesame!” and the door opened and shut behind him. He could have feasted his eyes all day on the treasures, but he now hastened to gather together as much of it as possible; but when he was ready to go he could not remember what to say for thinking of his great riches. Instead of “Sesame,” he said: “Open Barley!” and the door remained fast. He named several different sorts of grain, all but the right one, and the door still stuck fast. He was so frightened at the danger he was in that he had as much forgotten the word as if he had never heard it.\nAbout noon the robbers returned to their cave, and saw Cassim’s mules roving about with great chests on their backs. This gave them the alarm; they drew their sabres, and went to the door, which opened on their Captain’s saying: “Open Sesame!” Cassim, who had heard the trampling of their horses’ feet, resolved to sell his life dearly, so when the door opened he leaped out and threw the Captain down. In vain, however, for the robbers with their sabres soon killed him. On entering the cave they saw all the bags laid ready, and could not imagine how anyone had got in without knowing their secret. They cut Cassim’s body into four quarters, and nailed them up inside the cave, in order to frighten anyone who should venture in, and went away in search of more treasure.\nAs night drew on Cassim’s wife grew very uneasy, and ran to her brother-in-law, and told him where her husband had gone. Ali Baba did his best to comfort her, and set out to the forest in search of Cassim. The first thing he saw on entering the cave was his dead brother. Full of horror, he put the body on one of his asses, and bags of gold on the other two, and, covering all with some fagots, returned home. He drove the two asses laden with gold into his own yard, and led the other to Cassim’s house. The door was opened by the slave Morgiana, whom he knew to be both brave and cunning. Unloading the ass, he said to her: “This is the body of your master, who has been murdered, but whom we must bury as though he had died in his bed. I will speak with you again, but now tell your mistress I am come.” The wife of Cassim, on learning the fate of her husband, broke out into cries and tears, but Ali Baba offered to take her to live with him and his wife if she would promise to keep his counsel and leave everything to Morgiana; whereupon she agreed, and dried her eyes. \n\n This story is continued in next section : Check it out",
      "story_name": "Ali Baba and the Forty Thieves : Part 1",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Farabian%20nights%2Falibaba1.jpeg?alt=media&token=ebb7ea9c-89af-46fb-8a34-5944b18f09cc"
    },
    {
      "story_title": "Ali Baba and the Forty Thieves : Part 2",
      "story_description": "Morgiana, meanwhile, sought an apothecary and asked him for some lozenges. “My poor master,” she said, “can neither eat nor speak, and no one knows what his distemper is.” She carried home the lozenges and returned next day weeping, and asked for an essence only given to those just about to die. Thus, in the evening, no one was surprised to hear the wretched shrieks and cries of Cassim’s wife and Morgiana, telling everyone that Cassim was dead. The day after, Morgiana went to an old cobbler near the gates of the town who opened his stall early, put a piece of gold in his hand, and bade him to follow her with his needle and thread. Having bound his eyes with a handkerchief, she took him to the room where the body lay, pulled off the bandage, and bade him to sew the quarters together, after which she covered his eyes again and led him home. Then they buried Cassim, and Morgiana his slave followed him to the grave, weeping and tearing her hair, while Cassim’s wife stayed at home uttering lamentable cries. Next day she went to live with Ali Baba, who gave Cassim’s shop to his eldest son.\nThe Forty Thieves, on their return to the cave, were much astonished to find Cassim’s body gone and some of their money-bags. “We are certainly discovered,” said the Captain, “and shall be undone if we cannot find out who it is that knows our secret. Two men must have known it; we have killed one, we must now find the other. To this end one of you who is bold and artful must go into the city dressed as a traveller, and discover whom we have killed, and whether men talk of the strange manner of his death. If the messenger fails he must lose his life, lest we be betrayed.” One of the thieves started up and offered to do this, and after the rest had highly commended him for his bravery he disguised himself, and happened to enter the town at daybreak, just by Baba Mustapha’s stall. The thief bade him good-day, saying: “Honest man, how can you possibly see to stitch at your age?” “Old as I am,” replied the cobbler, “I have very good eyes, and will you believe me when I tell you that I sewed a dead body together in a place where I had less light than I have now.” The robber was overjoyed at his good fortune, and, giving him a piece of gold, desired to be shown the house where he stitched up the dead body. At first Mustapha refused, saying that he had been blindfolded; but when the robber gave him another piece of gold he began to think he might remember the turnings if blindfolded as before. This means he succeeded; the robber partly led him, and was partly guided by him, right in front of Cassim’s house, the door of which the robber marked with a piece of chalk. Then, well pleased, he bade farewell to Baba Mustapha and returned to the forest. By and by Morgiana, going out, saw the mark the robber had made, quickly guessed that some mischief was brewing, and fetching a piece of chalk marked two or three doors on each side, without saying anything to her master or mistress.\nThe thief,  in the meantime, told his comrades of his discovery. The Captain thanked him, and bade him to show him the house he had marked. But when they came to it they saw that five or six of the houses were chalked in the same manner. The guide was so confounded that he knew not what answer to make, and when they returned he was at once beheaded for having failed. Another robber was dispatched, and, having won over Baba Mustapha, marked the house in red chalk; but Morgiana being again too clever for them, the second messenger was put to death also. The Captain now resolved to go himself, but, wiser than the others, he did not mark the house, but looked at it so closely that he could not fail to remember it. He returned, and ordered his men to go into the neighbouring villages and buy nineteen mules, and thirty-eight leather jars, all empty except one, which was full of oil. The Captain put one of his men, fully armed, into each, rubbing the outside of the jars with oil from the full vessel. Then the nineteen mules were loaded with thirty-seven robbers in jars, and the jar of oil, and reached the town by dusk. The Captain stopped his mules in front of Ali Baba’s house, and said to Ali Baba, who was sitting outside for coolness: “I have brought some oil from a distance to sell at tomorrow’s market, but it is now so late that I know not where to pass the night, unless you will do me the favour to take me in.” Though Ali Baba had seen the Captain of the robbers in the forest, he did not recognize him in the disguise of an oil merchant. He bade him welcome, opened his gates for the mules to enter, and went to Morgiana to bid her to prepare a bed and supper for his guest. He brought the stranger into his hall, and after they had supped went again to speak to Morgiana in the kitchen, while the Captain went into the yard under pretence of seeing after his mules, but really to tell his men what to do. Beginning at the first jar and ending at the last, he said to each man: “As soon as I throw some stones from the window of the chamber where I lie, cut the jars open with your knives and come out, and I will be with you in a trice.” He returned to the house, and Morgiana led him to his chamber. She then told Abdallah, her fellow-slave, to set on the pot to make some broth for her master, who had gone to bed. Meanwhile her lamp went out, and she had no more oil in the house. “Do not be uneasy,” said Abdallah: “go into the yard and take some out of one of those jars.” Morgiana thanked him for his advice, took the oil pot, and went into the yard. When she came to the first jar the robber inside said softly: “Is it time?”\nAny other slave but Morgiana, on finding a man in the jar instead of the oil she wanted, would have screamed and made a noise; but she, knowing the danger her master was in, bethought herself of a plan, and answered quietly: “Not yet, but presently.” She went to all the jars, giving the same answer, till she came to the jar of oil. She now saw that her master, thinking to entertain an oil merchant, had let thirty-eight robbers into his house. She filled her oil pot, went back to the kitchen, and, having lit her lamp, went again to the oil jar and filled a large kettle full of oil. When it boiled she went and poured enough oil into every jar to stifle and kill the robber inside. When this brave deed was done she went back to the kitchen, put out the fire and the lamp, and waited to see what would happen.\nIn a quarter of an hour the Captain of the robbers awoke, got up, and opened the window. As all seemed quiet, he threw down some little pebbles which hit the jars. He listened, and as none of his men seemed to stir he grew uneasy, and went down into the yard. On going to the first jar and saying: “Are you asleep?” he smelt the hot boiled oil, and knew at once that his plot to murder Ali Baba and his household had been discovered. He found all the gang was dead, and, missing the oil out of the last jar, became aware of the manner of their death. He then forced the lock of a door leading into a garden, and climbing over several walls made his escape. Morgiana heard and saw all this, and, rejoicing at her success, went to bed and fell asleep.\n\n This story is continued in Ali Baba and the Forty Thieves: part 3",
      "story_name": "Ali Baba and the Forty Thieves : Part 2",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Farabian%20nights%2Falibaba2.jpeg?alt=media&token=e23c1d16-7d53-4ac8-9309-b528c29add67"
    },
    {
      "story_title": "Ali Baba and the Forty Thieves : Part 3",
      "story_description": "At daybreak Ali Baba arose, and, seeing the oil jars still there, asked why the merchant had not gone with his mules. Morgiana bade him look in the first jar and see if there was any oil. Seeing a man, he started back in terror. “Have no fear,” said Morgiana; “the man cannot harm you: he is dead.” Ali Baba, when he had recovered somewhat from his astonishment, asked what had become of the merchant. “Merchant!” said she, “he is no more a merchant than I am!” and she told him the whole story, assuring him that it was a plot of the robbers of the forest, of whom only three were left, and that the white and red chalk marks had something to do with it. Ali Baba at once gave Morgiana her freedom, saying that he owed her his life. They then buried the bodies in Ali Baba’s garden, while the mules were sold in the market by his slaves.\nThe Captain returned to his lonely cave, which seemed frightful to him without his lost companions, and firmly resolved to avenge them by killing Ali Baba. He dressed himself carefully, and went into the town, where he took lodgings in an inn. In the course of a great many journeys to the forest he carried away many rich stuffs and much fine linen, and set up a shop opposite that of Ali Baba’s son. He called himself Cogia Hassan, and as he was both civil and well dressed he soon made friends with Ali Baba’s son, and through him with Ali Baba, whom he was continually asking to sup with him. Ali Baba, wishing to return his kindness, invited him into his house and received him smiling, thanking him for his kindness to his son. When the merchant was about to take his leave, Ali Baba stopped him, saying: “Where are you going, sir, in such haste? Will you not stay and sup with me?” The merchant refused, saying that he had a reason; and on Ali Baba’s asking him what that was, he replied: “It is sir, that I can eat no victuals that have any salt in them.” “If that is all,” said Ali Baba, “let me tell you that there shall be no salt in either the meat or the bread that we eat tonight.” He went to give this order to Morgiana, who was much surprised. “Who is this man?” she said, “who eats no salt with his meat?” “He is an honest man, Morgiana,” returned her master, “therefore do as I bid you.” But she could not withstand a desire to see this strange man, so she helped Abdallah to carry up the dishes, and saw in a moment that Cogia Hassan was the robber Captain, and carried a dagger under his garment. “I am not surprised,” she said to herself, “that this wicked man, who intends to kill my master, will eat no salt with him, but I will hinder his plans.”\nShe sent up the supper by Abdallah, while she made ready for one of the boldest acts that could be thought on. When the dessert had been served, Cogia Hassan was left alone with Ali Baba and his son, whom he thought to make drunk and then to murder them. Morgiana, meanwhile, put on a head-dress like a dancing-girl’s, and clasped a girdle round her waist, from which hung a dagger with a silver hilt, and said to Abdallah: “Take your tabor, and let us go and divert our master and his guest.” Abdallah took his tabor and played before Morgiana until they came to the door, where Abdallah stopped playing and Morgiana made a low courtesy. “Come in, Morgiana,” said Ali Baba, “and let Cogia Hassan see what you can do,” and turning to Cogia Hassan, he said: “She’s my slave and my housekeeper.” Cogia Hassan was by no means pleased, for he feared that his chance of killing Ali Baba was gone for the present, but he pretended great eagerness to see Morgiana, and Abdallah began to play and Morgiana to dance. After she had performed several dances she drew her dagger and made passes with it, sometimes pointing it at her own breast, sometimes at her master’s, as if it were part of the dance. Suddenly, out of breath, she snatched the tabor from Abdallah with her left hand, and, holding the dagger in her right hand, held out the tabor to her master. Ali Baba and his son put a piece of gold into it, and Cogia Hassan, seeing that she was coming to him, pulled out his purse to make her a present, but while he was putting his hand into it Morgiana plunged the dagger into his heart.\n“Unhappy girl!” cried Ali Baba and his son, “what have you done to ruin us?”\n“It was to preserve you, master, not to ruin you,” answered Morgiana. “See here,” opening the false merchant’s garment and showing the dagger. “See what an enemy you have entertained! Remember, he would eat no salt with you, and what more would you have? Look at him! He is both the false oil merchant and the Captain of the Forty Thieves.”\nAli Baba was so grateful to Morgiana for thus saving his life that he offered her to his son in marriage, who readily consented, and a few days after, the wedding was celebrated with greatest splendor.\nAt the end of a year Ali Baba, hearing nothing of the two remaining robbers, judged they were dead, and set out to the cave. The door opened on his saying: “Open Sesame!” He went in, and saw that nobody had been there since the Captain left it. He brought away as much gold as he could carry, and returned to town. He told his son the secret of the cave, which his son handed down in his turn, so the children and grandchildren of Ali Baba were rich to the end of their lives.",
      "story_name": "Ali Baba and the Forty Thieves : Part 3",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Farabian%20nights%2Falibaba3.jpeg?alt=media&token=064fb557-db63-4443-8fa1-be7622db7cb2"
    },
    {
      "story_title": "Sinbad the Sailor",
      "story_description": "Long ago, in the city of Baghdad, there lived a man named Sinbad the Hammál. He made his living by lugging around heavy objects on his head. In short he was a porter, as hard working, as he was poor. One exceedingly hot and dusty day, he was weary and sweating, and not sure if the heat or his load was causing him the most trouble. He staggered past the entrance of a wealthy merchant’s house. The sight of a bench by the gates was so tempting, that he could not resist setting down his load, and sitting down for a while. As he rested he felt a pleasant breeze and heard the sound of a lute playing and light voices full of laughter and song. He stood up and pushed the gates open slightly. As he peaked through them, he saw a garden full of flowers, and servants carrying all sorts of rich and delicate meats.\n\n The delicious aroma greeted his nostrils and filled him with hunger. As he stood there he recited some lines: “Each morn that dawns I awake in pain and woe.. I pick up my load and off to work I go.. while others live in comfort and delight.. with pretty song, good food, and laughter light.. All living things were born in their birthday suit.. But some live like Lords and others like brutes.. At Thee, O God all-wise! I dare not to rail.. Whose creation is just and whose justice cannot fail.” When Sinbad the Porter had finished his verse, he picked up his heavy crate and started to move off. Just as he put one foot forward, there came from the gate a little servant boy who tugged at his sleeve and said: “Step inside, my Lord wishes to meet you.” The porter tried to make excuses, but the boy would have none of them, and eventually they went through the gate together. They walked through a majestic house to the grand dining room which was full of Lords sitting at tables laden with rich food and drink. The sound of music and laughter and lovely slave girls playing and singing filled the air. The diners were seated according to rank, and at the head of them all sat a man of worshipful and noble appearance. Sinbad the Porter was so overwhelmed by all that he saw that he said to himself: “By Allah, this must be either a piece of paradise or some king’s palace!” He bowed down and kissed the ground. \n\nThe master of the house bid him to stand up. Servants placed food before him and and the porter, after saying his Bismillah, ate his fill, after which he exclaimed: “Praised be Allah for your generosity my Lord.” His host replied: “You are most welcome and may your day be blessed, but tell me, what is your name and what do you do all day?” “O my Lord, my name is Sinbad the Hammal, and I carry folk’s goods on my head for hire.” The master of the house smiled and said: “You should know, oh porter, that you and I have something important in common – our name! For I am Sinbad the Sailor. Now if you will be so kind, let me hear those verses that you recited outside the gate of my house.” The porter blushed, because he did not wish to repeat the lines about injustice among such wealthy and fortunate company.\n\n “By Allah excuse me!” he exclaimed. “Poverty and hardship have given me boorish ways!” “Tish Tish, do not be ashamed,” said the Lord, but say them again, for they pleased me when I heard you speak them at the gate. The porter duly recited the lines and the merchant slapped his back affectionately and said: “No one ever spoke a truer word. But you should know that I myself only rose to this happy state that you see all around you after long suffering and woe. I made seven voyages at sea, and by each of them hangs a marvellous tale that is almost beyond belief. If you have time, I shall tell you the first of these tales so that you can better understand what pain I endured in my early days. All this happened because of fate, for no one can escape destiny.” And this is the tale of the first voyage of Sinbad the Sailor.",
      "story_name": "Sinbad the Sailor",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Farabian%20nights%2Fsindbad.jpeg?alt=media&token=08495288-eeed-4ffa-a41a-c3f307b9db1e"
    }
  ]
}