{
  "stories": [
    {
      "story_name": "An elf and ant",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ffunny%2Felephantjpeg.jpeg?alt=media&token=1f5b688c-c0c1-4024-8c22-c967bb6e40b4",
      "story_title": "An elf and ant",
      "story_description": "An elf loved his pet ant. He tried to feed him the best he could. The ant gobbled whatever the elf would feed him. As time passed and as the ant kept gobbling, it got bigger and bigger till he couldn't fit in the room. Reluctantly, the elf gave the ant to the zoo. Everyone knew the elf's ant at the zoo, and over time, the ant became known as the \"elephant.\" Today, when people go to see the elephant in the zoo, they don't know the story behind its odd name. "
    },
    {
      "story_name": "Child and Mother",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ffunny%2Fmother_child.jpeg?alt=media&token=6286ef01-6097-4c81-8b8e-fcf645d00410",
      "story_title": "Child and Mother",
      "story_description": "A curious child asked his mother about her greying hair. Her mother thought it could be an opportunity to teach her child a lesson. So, she said that every bad action of his turns one of her hairs grey. The child innocently replies that now he knows why his grandmother has only grey hairs on her head."
    },
    {
      "story_name": "The Emperor's new clothes",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ffunny%2Femperor.jpeg?alt=media&token=e19b2396-499d-48bc-8afa-0660bbe1ebef",
      "story_title": "The Emperor's new clothes",
      "story_description": "An emperor loves wearing expensive new clothes every day, paying more attention to his grooming than to his duties as the ruler. Two conmen visit the emperor posing themselves as the weavers. They pretend to show a fabric that only wise and honest people could see. The emperor cannot see the fabric but pretends to see it because he doesn't want them to think of him as a dishonest fool. He hires the conmen to make clothes for him. When the conmen tell the emperor that the robe is ready, he decides to wear it in an upcoming procession. \n\nThe emperor cannot see the robe but pretends to wear it nonetheless, appearing naked in front of a huge number of people. The people remain silent, looking at the naked emperor because nobody wants to be called dishonest and foolish. But an innocent child starts laughing loudly, looking at the naked emperor. And the laughter spreads. Knowing there is no way back, the emperor continues the procession and decides to punish the conmen. But by then, they had already gone with the hefty sum of money for the clothes they never made. "
    },
    {
      "story_name": "Five Rats and a Funny Top Hat",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ffunny%2Fcat%20and%20rat.jpeg?alt=media&token=9de991fc-7691-4727-a0e3-1cdef1ab7a31",
      "story_title": "Five Rats and a Funny Top Hat",
      "story_description": "Samson, a big black fat cat, lay across a mat pretending to be asleep with one eye looking right at the hole in the wall where five rats lived. The rats wanted to get away from the cat but were scared to make a move. When a man who entered the house dropped his hat on the floor, the rats knew that they had a chance to get away from the cat. All of them hid under the hat and started moving towards the open door. The cat spotted the hat moving and started walking towards it. But as luck would have it, a sudden gust of wind tipped the hat over, and the rats fell into it. The wind blew the hat into the pond where it floated. Samson was angry because he couldn't swim. That's how the rats escaped from the wrath of the big black fat cat."
    },
    {
      "story_name": "The Missing Tenth Man",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fprincess%2Fmermaid.jpeg?alt=media&token=6310b9b7-9968-4de6-8672-ce1f10af7c70",
      "story_title": "The Missing Tenth Man",
      "story_description": "Ten men go to the Ganges to take a dip in the holy river. While taking a dip, they hold each other's hands but somehow forget to hold their hands when coming out of the water. Once on the shore, the eldest man starts the count. He asks all of them to raise their hands, and the count stops at nine. All are confused, and each person takes a turn to take the count. They all count till 9. They frantically start looking for the missing tenth man. A cap seller watching this amusing scene gives each of them a cap to wear. He asks the eldest man to collect and count all the caps, including the one he is wearing. Lo and behold! There were 10 caps in total."
    },
    {
      "story_name": "Doctor and the Old Man",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ffunny%2Fdoctor.jpeg?alt=media&token=4549d136-11d5-4e11-92fe-3c5804af2fc0",
      "story_title": "Doctor and the Old Man",
      "story_description": "An old man visits a doctor to seek treatment for the severe pain he has in his right leg. The doctor tells him that the pain is due to his age and that nothing can be done about it. The old man gets angry and questions the doctor's ability and expertise. When the doctor asks him why he feels that he is incapable, the old man replies that his left leg is as old as the right leg, but it has no pain at all. "
    },
    {
      "story_name": "Sandwiches",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ffunny%2Fsandwich.jpeg?alt=media&token=0b939a02-6138-4f16-866c-6e1039a13ae1",
      "story_title": "Sandwiches",
      "story_description": "Two friends who are lawyers go to a restaurant and order cold drinks. After ordering cold drinks, both take out sandwiches from their bags and start eating them. Looking at them eat, the waiter comes to their table and tells them that it's not allowed to eat their own sandwiches in the restaurant. Both friends look at each other, smile and exchange their sandwiches. "
    },
    {
      "story_name": "The Coconut Vendor",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ffunny%2Fcoconut.jpeg?alt=media&token=b7ad790b-cb3f-4da9-98d1-a91cb69150a4",
      "story_title": "The Coconut Vendor",
      "story_description": "A coconut vendor goes to a farm to collect coconuts. He gathers a massive number of coconuts in a basket. He mounts the basket on the horse and continues his journey back home. He sees a young boy nearby. He asks him how long it would take him to reach the city. The boy replies that if he goes slowly, he'll reach faster and if he speeds up, he'll reach slowly. The coconut vendor doesn't understand the logic behind the boy's statement. He continues his journey home and makes his horse run faster. Every time he makes his horse run faster, the coconuts fall off the basket, and he stops his journey to collect them. He reaches home late at night, quite later than he had expected. He then realises what the boy had meant."
    },
    {
      "story_name": "Two Cats and the Monkey",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ffunny%2Fcat_monkey.jpeg?alt=media&token=3900c2b3-ab71-4c88-bb27-335d50dd24d7",
      "story_title": "Two Cats and the Monkey",
      "story_description": "Two cats were fighting for a piece of bread. A clever monkey, seeing the debacle, decided to help them. He told them he'd split the bread into two pieces to be shared equally between them. The cats agreed, but one piece was bigger than the other when he did the split. He took a bite from the bigger piece to make it equal. But this time, the other piece was bigger. This went on for a while until, in the end, the monkey ate up the whole bread. The monkey went home, leaving behind two hungry, angry cats. "
    },
    {
      "story_name": "Frog and his Belly Burst",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ffunny%2Ffrog.jpeg?alt=media&token=4c70fd85-32ab-4c09-8291-2f836ce41cab",
      "story_title": "Frog and his Belly Burst",
      "story_description": "Father frog and son frog live in a pond. While playing in the garden, the son frog sees a cow. He rushes to the pond to tell his father that he has spotted a monster. The father frog doesn't believe him and tells him to describe the monster's size. The father breathes in, fills his stomach with air, and asks his son whether the monster was this big. The son says it was bigger. The father frog keeps on filling the air in his belly until his belly burst, and he cries out in pain. "
    }
  ]
}