{
  "stories": [
    {
      "story_name": "Early life of Buddha",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fmotivational%2Fbuddha_1.jpeg?alt=media&token=9a5d7b7d-f9b3-41af-a2ac-23f3c8cf50b0",
      "story_title": "Early life of Buddha",
      "story_description": "Gautama was a prince of a small princely state. When he was born, some Yogi predicted that he will either become a great emperor or a great sage. When he made this prediction, Gautama’s father got a little excited. He did not want him to become a great sage. He wanted him to become a great emperor. He thought that by being exposed to some suffering or misery, he may turn into a sage. So he kept him in utter pleasure – the best of food, clothes and pleasures. When he was nineteen years of age, his father got him married to a very pretty young woman, kept him in a palace which was secluded from the rest of the society, where he lived in pleasure and was never exposed to any kind of suffering. One day, Gautama thought that he will just take a drive through the town, so he asked his charioteer to take him across.\n\nAs he was going, he saw a man who was old. He had never seen an old man in his life. His father had protected him from all this. He said, \"What happened to him?\" The charioteer said, \"Oh, he is just an old man.\" \"How does it happen?\" he asked. He said, \"Everyone gets old someday.\" He looked at himself; he was a nice youth. \"What, me also?\" He said, \"Yes, everyone gets old. If they live long enough, they get old.\" This was a realization for him that \"I will become like this.\"\n\nThen he saw a man lying on the street who was ill with something, not able to get up and in great suffering. He said, \"Stop! What is this guy? What's he doing?\" He said, \"Oh, he is sick, unfortunately.\" \"What does that mean?\" He said, \"The body, sometimes it gets sick. It can happen to just anyone.\" \"Me, a prince? It can happen to me?\" \"It can happen to anyone.\" Then he saw, \"Oh, I can become like this.\" He was completely disturbed by this. Then they went further and he saw a funeral. They were carrying the dead body of a man. \"What happened to that guy?\" \"Oh, he just died, that’s all.\" \"What does that mean?\" \"That happens to everyone without exception.\" Then he said, \"What am I doing? Just eating, pleasures and nonsense! What am I doing with myself?\" He went into turmoil within himself. Suddenly, being a prince and the pleasures of this palace broke apart for him.\n\nHe started looking, \"What is the point of all this? This body is going to get old, this may get sick and this will be dead for sure. Why am I investing my entire life in this?\" But by then he had an infant boy. He could not leave this loving wife and this lovely little baby. He struggled and struggled.\n\nBy then, a little over one-and-a-quarter year had passed. When the little boy was one-and-a-half years of age, he could not hold it anymore – in the middle of the night, without telling anyone, he slipped out of the palace like a thief and left for good. He went in search, \"I want to know the truth about this life.\""
    },
    {
      "story_name": "How Gautama Became a Buddha",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fmotivational%2Fbuddha_2.jpeg?alt=media&token=3818c0a4-4902-4778-9545-6b8f917b45ac",
      "story_title": "How Gautama Became a Buddha",
      "story_description": "When he realized that everything is within him and there is nowhere to search, he suddenly had the energy to take the next step and the next step. He crossed the river and sat down under that now very famous Bodhi tree. It was a full moon night. He sat there with this determination, \"Either I must see the ultimate nature of my existence now, or I will sit here and die. I will not open my eyes till I know this.\"\n\nOnce he made that resolve, to know what is within you, can happen in a moment. When he saw that you do not have to do anything in particular for realization, he was fully enlightened. And the moon was shining. He had not eaten properly for many years. He was a samana for four years and he had gathered five disciples. These guys thought, \"He is real. Because he does not eat, he is really rigid,\" and now they saw that he is in some exuberant state and they could see the light on his face. Then they were waiting for him to open his eyes and give the teaching. He opened his eyes, looked at them, smiled and said, \"Cook something, let's eat.\" They were totally disappointed. They thought, \"He has lost it.\" They walked with him for four years when he had nothing but torture, but when he got enlightened, they left him because they wanted to hear something severe. But he said, \"Cook something, let's eat. We have been wasting our time.\""
    },
    {
      "story_name": "Wake up! Time is running out",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Finspirational%2Fscene_4.jpeg?alt=media&token=fa81bb38-efdf-4559-acc4-e6432706ecfe",
      "story_title": "Wake up! Time is running out",
      "story_description": "Once, in the bustling city of Jetavana, Buddha stood before a vast assembly, delivering his sermon with profound wisdom. As he concluded, his words echoed through the hearts of his listeners: \"Wake up! Time is running out!\"\n\nExiting the gathering with his devoted disciples, including Ananda and Shariputra, Buddha noticed a lingering crowd eager for a glimpse of the enlightened one. Seeking solitude, he paused near the gates, hoping the throng would disperse. However, fate had other plans.\n\nA dancer, rushing towards Buddha, expressed gratitude for his timely reminder. His words had awakened her memory of a forgotten performance commitment. Touched by her sincerity, Buddha blessed her with a smile.\n\nMoments later, a conflicted man confessed his intent to commit theft but believed Buddha's words sanctioned his actions. Buddha, emphasizing non-harm, guided him towards righteousness without judgment.\n\nReturning to his dwelling, Buddha reflected on the varied interpretations of his message. He shared with his disciples the essence of \"right view,\" emphasizing the consequences of actions and the importance of understanding diverse perspectives.\n\nThe story resonates with modern challenges, where conflicting beliefs and perspectives often lead to discord. Buddha's teachings highlight the need for empathy, patience, and wisdom in resolving conflicts and embracing different viewpoints.\n\nIn a world driven by diverse experiences and perceptions, the journey towards harmony begins with understanding and accepting varied perspectives. As Buddha's words echo through time, they remind us to awaken to the richness of diversity and the interconnectedness of all beings."
    },
    {
      "story_name": "Shark Bait",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fmotivational%2Fshark.jpeg?alt=media&token=a2f537e8-4421-4981-89e8-798e6805b735",
      "story_title": "Shark Bait",
      "story_description": "A marine biologist put a shark into a big tank at the time of a research experiment. Followed by that, he released some tiny bait fishes into it.\n\nAs expected, the shark didn’t wait to attack those fishes and ate them. Later, a clear fiberglass was inserted into the tank which partitioned the tank into two and the shark remained in one side.\n\nA similar set of bait fish was sent to the other side of the tank like before. And the shark attempted to attack those fishes but failed by hitting on the fiberglass.\n\nThe shark attempted for several days until it gave up. Later, the biologist removed the glass from the tank but the shark didn’t try to attack the small fishes.\n\nThe shark always continues to see a false barrier in the tank and stopped his attempts.\n\nMoral: It is quite common for many people to give up after many setbacks and failures. The story is an example for keep trying always and to never give up despite multiple failures."
    },
    {
      "story_name": "Thinking Out of the Box",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fmotivational%2Fout_of_box.jpeg?alt=media&token=ec7d7a97-19e3-49e2-9c26-e8e3b71598ed",
      "story_title": "Thinking Out of the Box",
      "story_description": "Once upon a time, a merchant named Sam owed a huge sum of money to Tom, a money lender. The time came when the merchant ran out of the last chance given to him to give the money back.\n\n Sam had a beautiful daughter who was very affectionate with her father. Tom asked the merchant to give all the money back failing which he will marry his beautiful daughter.\n\nTom was not at all good looking and ill minded and so the merchant was in dilemma. Tom proposed a new condition. There was a mix of black and white pebbles on the ground where they were standing. He will take two pebbles on both hands, one will be white and the other will be black.\n\nIf the daughter correctly chooses the white pebble, then Tom will write off all the debt and leave the marriage proposal too. But if she chooses the black pebble, he will write off the debt but will marry the daughter.\n\nTom bent down to pick the pebbles from the ground and the daughter noticed that he took black pebbles on both hands. The girl had three choices- to notify the same to her father which may provoke Tom, take the black pebble and sacrifice her life or simply refuse to take the pebble which might land her father into trouble. But what she did totally surprise Tom.\n\nShe took the pebble from his hand and ‘accidentally’ the pebble fell off from her hand to ground. She then asked Tom to see which color pebble was left in his hand to identify the color she picked. Tom had no other choice but to show the black color pebble in his hand and set both of them free.\n\nMoral: Sometimes, life offers you situations which not only demands hard work and perseverance but some creative thinking which saves the situation."
    },
    {
      "story_name": "The Group of Frogs",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fmotivational%2Ffrogs.jpeg?alt=media&token=4b2509ff-0f31-403f-94e3-4327ee64e441",
      "story_title": "The Group of Frogs",
      "story_description": "Some frogs were traveling through woods and two of them accidentally fell into a pit. The other frogs which were safe upside understood how deep the pit was and saw no hope for the frogs to escape out of it.\n\nBoth of these frogs started trying to get out of the pit but failed many times. The frogs on the safe side shouted at them to give up the pain of trying as it was not possible.\n\nEventually, one frog heard the other frogs and decided to stop trying and fell down to death. However, the other frog went on trying and at last managed to reach the top.\n\nThe other frogs asked him, “Did you not hear us?” He explained that he was deaf and thought other frogs were encouraging him to get out.\n\nMoral: Some people around you may ask you to be on a safer side always and stop trying and taking risks. However, there is no gain without pain. So try hard to achieve success in life despite what life offers you."
    },
    {
      "story_name": "Rocks, Pebbles and Sand",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fmotivational%2Fpebbles.jpeg?alt=media&token=89641a02-dd0d-43bd-abb7-21d3c009cc13",
      "story_title": "Rocks, Pebbles and Sand",
      "story_description": "Once a professor entered the classroom with a glass jar, rocks, pebbles, and sand. The students were amused to see what he was up to. First, he started filling the rock parts into the jar until he couldn’t add any more.\n\nHe asked the students if the jar was full and everybody nodded yes. He then started putting the pebbles inside the jar which went inside through the small gaps and he shakes the jar to allow the pebbles to get into those vacant spaces in between the rocks.\n\nHe asked the same question to the students and they again said that the jar was full. Finally, he poured the sand inside the jar which went through the minute gaps and got filled in the jar.\n\nThe professor explained that this is how you should set priorities in life. Rock is like your family, while pebbles are like your career while sand is like the least priorities in life and unnecessary quarrels and egos.\n\nIf you put sand on the jar first, it will get easily filled up leaving no space for rocks and pebbles.\n\nMoral: You should identify your priorities in life and develop a good strategy to work towards fulfilling it rather than wasting your time and effort on unnecessary aspects of life."
    },
    {
      "story_name": "Your struggles develop strength",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fmotivational%2Fobstacle.jpeg?alt=media&token=936dc0a4-fa3b-4e28-bacb-029459e7d719",
      "story_description": "One day a man was passing by a garden when he saw a butterfly cocoon which was about to get open.\n\nHe saw a small opening on it and watched the several hours of struggles the butterfly came through to get the body out of it. After many hours, it seemed that the butterfly stopped trying as there was no progress.\n\n He thought to help the butterfly by cutting the cocoon with a scissor. So the butterfly came out easily but the wings were shriveled and the body was tiny and withered.\n\nUnfortunately, the butterfly was not able to take flight and spend the rest of life crawling with a wounded body.\n\nMoral: This is nature’s way of telling the importance of struggles in life. Sometimes, different kinds of struggles are needed in life to make you stronger in the future. Never feel disappointed in life and stop trying when life offers you struggles but keep on fighting until you see success."
    },
    {
      "story_name": "Seeing opportunity in obstacles",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fmotivational%2Fclearing_obstacle.jpeg?alt=media&token=9f91c7fe-968f-4c31-8ced-7c45ac45e116",
      "story_title": "Seeing opportunity in obstacles",
      "story_description": "Once there was a king who was curious but wealthy. He decided to test his fellow people to know who has a got a good attitude in life and who would spare some time for country’s progress.\n\n He placed a huge boulder right at the middle of the road and hid in a nearby place to see if anyone would make an attempt to move it off.\n\nHe saw some wealthy merchants and courtiers passing by the road. None of them made any attempt to move it off but simply walked away while some others blamed the king for not maintaining roads.\n\nLater, a peasant came the way with a load of vegetables and saw the boulder. He kept his load down and tried to move the boulder away. After strenuous effort, he succeeded in moving it away. He saw a purse lying in the place of the boulder.\n\nIt contained many gold coins and a note from the king which read ‘this is the reward for the person who moves the boulder away’.\n\nMoral: It is quite common for people to run away from problems and obstacles. But the story clearly shows the importance of seeing an opportunity in every obstacle which might improve our condition. Invest some time to remove obstacles on your way and experience many unseen presences."
    },
    {
      "story_name": "Value yourself",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fmotivational%2Fvalue%20yourself.jpeg?alt=media&token=c252168e-60af-4e4c-af35-5a5d4bfec327",
      "story_title": "Value yourself",
      "story_description": "A speaker started off his seminar by showing a $20 to the public. He asked the people “who wants this?” There was no surprise to see that all of them lifted their hands. He offered to give the money to one of them but insisted that he will do something to it.\n\nHe crumpled the paper money and showed it again to the crowd and repeated the question. Still, everyone raised the hands. He then put the money into the ground and stepped on it and then raised it again and offered it to the public.\n\nThe people gathered there still showed interest to take that money despite seeing how dirty the note was. He told the public” No matter what I did to this money, you all still wanted this.\n\nYou all went in favor of my offer just because the value of the money never decreased despite what all I did to it. Similarly, value yourself despite the painful conditions or failures”\n\nMoral: Believe in yourself and work hard to achieve success. Value yourself irrespective of the failures or obstacles and don’t degrade yourself just because of the temporary setbacks.   "
    }
  ]
}