{
  "stories": [
    {
      "story_name": "Lion and a mouse",
      "story_image":"https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Flion_mouse.jpeg?alt=media&token=55d3d1cd-561e-48c6-b1f5-53640f22639e",
      "story_title": "Lion and a mouse",
      "story_description": "Once, in a forest, a big Lion was sleeping peacefully with his head resting on his paws. Suddenly, a small Mouse stumbled upon him and accidentally ran across his nose. Startled, the Lion woke up and got angry. He wanted to crush the tiny Mouse under his paw. \n\n The Mouse, trembling with fear, pleaded, 'Please spare me! If you let me go, I promise I'll help you someday.' \n\n The Lion found it funny that such a tiny creature could be of any help to him. But he decided to show kindness and let the Mouse go. \n\n Some time later, while the Lion was hunting in the forest, he got trapped in a hunter's net. He struggled hard but couldn't break free. His loud roars filled the air, and the Mouse recognized his voice. Quickly, she ran to the net and began gnawing at the ropes until they broke. Soon, the Lion was free. \n\n 'You laughed when I said I'd help you' said the Mouse. 'But now you see, even a little Mouse can come to the aid of a mighty Lion."
    },
    {
      "story_name": "Three little pigs",
      "story_image":"https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fthree_little_pigs.jpeg?alt=media&token=ea28870f-212d-45f5-8956-bc26c48a7f38",
      "story_title": "Three little pigs",
      "story_description": "Once upon a time, there were three little pigs who lived with their mother in a cozy little house. As they grew up, their mother realized it was time for them to go out into the world and build their own homes.\n\nThe first little pig, being a bit lazy, decided to build his house quickly out of straw. He wanted to spend more time relaxing and having fun.\n\nThe second little pig was a little more hardworking than the first. He built his house out of sticks. It wasn't the sturdiest, but it was quicker to build than a house made of bricks.\n\nThe third little pig, however, was very wise. He knew the importance of hard work and building something strong that would last. So, he spent a long time building his house out of bricks, even though it took more effort.\n\nOne day, a big bad wolf came wandering through the forest. He spotted the first little pig's straw house and decided to pay him a visit. \"Little pig, little pig, let me come in!\" he called out. But the little pig remembered his mother's warning and replied, \"Not by the hair of my chinny chin chin!\"\n\nThe wolf huffed and puffed and blew the straw house down, sending the little pig scurrying to his brother's house made of sticks.\n\n The wolf followed and repeated his request to the second little pig. \"Little pig, little pig, let me come in!\" But the second little pig also refused and replied, \"Not by the hair of my chinny chin chin!\" The wolf huffed and puffed again, and this time, he blew the stick house down.\n\n The two little pigs ran as fast as they could to their brother's house made of bricks. The wolf arrived shortly after and demanded to be let in. But the third little pig, knowing his house was strong, confidently said, \"Not by the hair of my chinny chin chin!\"\n\nNo matter how hard the wolf huffed and puffed, he couldn't blow the brick house down. Frustrated, he tried to climb down the chimney, but the clever little pig had a pot of boiling water waiting for him. The wolf yelped and ran away, never to bother the three little pigs again.\n\nFrom that day on, the three little pigs lived happily ever after in their sturdy brick house, knowing that hard work and perseverance always pay off in the end."
    },
    {
      "story_name": "Ants and grass hopper",
      "story_image":"https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fgrasshopper_ants.jpeg?alt=media&token=e3b9ecb9-1cfa-486d-8c46-e5cd4ec5c24b",
      "story_title": "Ants and grass hopper",
      "story_description": "Once upon a time, on a sunny day in autumn, a family of ants was busy drying out the food they had saved during the summer. Suddenly, a hungry grasshopper, carrying his fiddle, came to them and asked for some food.\n\nThe ants were surprised. \"Didn't you save any food for winter?\" they asked. \"What were you doing all summer?\"\n\nThe grasshopper replied sadly, \"I didn't have time to save food. I was too busy playing music, and then summer ended before I knew it.\"\n\nThe ants were not impressed. \"Playing music, huh?\" they said. \"Well, now it's time to dance!\" And they ignored the grasshopper and continued their work.\n\n The story teaches us that there's a time for work and a time for play."
    },
    {
      "story_name": "How the Camel Got His Hump",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fcamel_hump.jpeg?alt=media&token=09a98564-0e43-438a-a4a8-35789b42d76e",
      "story_title": "How the Camel Got His Hump",
      "story_description": "In the days when the world was still young and new, and animals were just beginning to serve humans, there lived a Camel in the heart of a Howling Desert. The Camel, being a Howler himself and quite fond of idleness, spent his days munching on sticks, thorns, and other prickly plants, responding to anyone who spoke to him with a curt \"Humph!\" and nothing more.\n\nOne Monday morning, the Horse approached him with a saddle on his back and asked the Camel to come out and trot with the others. Disinterested, the Camel dismissed him with another \"Humph!\" Similar encounters followed with the Dog, who asked the Camel to fetch and carry, and the Ox, who requested him to plow. Each time, the Camel responded with a disdainful \"Humph!\" and carried on with his idle ways. \n\nAt day's end, the Man gathered the Horse, Dog, and Ox and acknowledged their extra burden caused by the Camel's laziness. Deciding to let the Camel be, the Man tasked the trio to work double-time to make up for it, much to their dismay.\n\nFeeling indignant, the Horse, Dog, and Ox held a meeting at the edge of the Desert to discuss the matter. Meanwhile, the Camel continued his leisurely grazing, unperturbed by their concerns, and casually uttered another \"Humph!\" to mock them.\n\nSoon, the Djinn in charge of All Deserts arrived, having heard of the Camel's idleness. The Horse, Dog, and Ox explained the situation, and the Djinn resolved to teach the Camel a lesson.\n\nApproaching the Camel, the Djinn questioned him about his laziness. Unconcerned, the Camel responded with his usual \"Humph!\" The Djinn, considering a Great Magic, warned the Camel of the consequences of his idleness.\n\nSuddenly, the Camel's back began to swell into a large hump, a consequence of his refusal to work. Realizing his predicament, the Camel pleaded with the Djinn, but it was too late. The Djinn explained that the hump was his punishment for missing three days of work, and he would have to carry it forever.\n\nDespite his protests, the Camel was left with no choice but to join the others and carry out his duties. Since that day, the Camel has worn his hump as a reminder of his laziness, never quite catching up on the missed days of work and never fully learning his lesson."
    },
    {
      "story_name": "Princess and the frog",
      "story_image":"https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Fprincess_frog.jpeg?alt=media&token=c7ec6452-f431-4d2c-bf1f-2d356100276b",
      "story_title": "Princess and the frog",
      "story_description": "Once upon a time, in a land far away, a young princess ventured into a forest wearing her bonnet and clogs. She carried her beloved golden ball, tossing it up and catching it as she walked. However, her fun was interrupted when the ball slipped from her fingers and rolled into a deep spring. The princess was distraught, willing to give up everything she owned just to retrieve her precious ball.\n\nA frog emerged from the water and offered to help, but the princess dismissed him, thinking he couldn't possibly assist her. Yet the frog persisted, promising to retrieve the ball if the princess agreed to let him live with her and share her comforts. Desperate to recover her ball, the princess reluctantly agreed.\n\nTrue to his word, the frog retrieved the ball from the spring. Overjoyed, the princess snatched it and ran off without fulfilling her promise to the frog. However, the next day, the frog appeared at her door, reminding her of her promise. Reluctantly, she allowed him in, and he demanded to eat from her plate and sleep in her bed. Despite her discomfort, the princess complied.\n\nThis routine continued for three nights until, on the fourth morning, the princess woke to find a handsome prince standing by her bed. He explained that he had been enchanted by a wicked fairy and could only be freed by a princess willing to share her home with him. The princess had broken the curse, and the frog had transformed back into a prince.\n\nGrateful for her kindness, the prince invited the princess to his kingdom, where they would marry and live happily ever after. The princess eagerly accepted, and they embarked on a journey in a splendid coach with eight horses. Alongside them rode the prince's faithful servant, Heinrich, who had mourned his master's misfortune throughout his enchantment.\n\nWith hearts full of joy, they set off for the prince's kingdom, where they would build a life together, free from enchantments and filled with love and happiness for many years to come."
    }
  ]
}