{
  "stories": [
    {
      "story_title": " The Biggest Fool In The Kingdom",
      "story_description": "King Krishnadevaraya loved horses and had the best collection of horse breeds in the Kingdom. Well, one day, a trader came to the King and told him that he had brought with him a horse of the best breed in Arabia.\n\nHe invited the King to inspect the horse. King Krishnadevaraya loved the horse; so the trader said that the King could buy this one and that he had two more like this one, back in Arabia that he would go back to get. The King loved the horse so much that he had to have the other two as well. He paid the trader 5000 gold coins in advance. The trader promised that he would return within two days with the other horses.\n\nTwo days turned into two weeks, and still, there was no sign of the trader and the two horses. One evening, to ease his mind, the King went on a stroll in his garden. There he spotted Tenali Raman writing down something on a piece of paper. Curious, the King asked Tenali what he was jotting down.\n\nTenali Raman was hesitant, but after further questioning, he showed the King the paper. On the paper was a list of names, the King’s being at the top of the list. Tenali said these were the names of the biggest fools in the Vijayanagara Kingdom!\n\nAs expected, the King was furious that his name was at the top and asked Tenali Raman for an explanation. Tenali referred to the horse story, saying the King was a fool to believe that the trader, a stranger, would return after receiving 5000 gold coins.\n\nCountering his argument, the King then asked, what happens if/when the trader does come back? In true Tenali humour, he replied saying, in that case, the trader would be a bigger fool, and his name would replace the King’s on the list!",
      "story_name": " The Biggest Fool In The Kingdom",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ftenali%2Fjotting.jpeg?alt=media&token=de1dd152-6376-471c-a5ac-e91927abbc7c"
    },
    {
      "story_title": "Handful of grain and coins",
      "story_description": "There was an arrogant woman named Vidhyulatha in the Vijayanagara Kingdom. She was proud of her accomplishments and loved showing off her intelligence. One day she put up a board outside her house, offering anyone 1000 gold coins if they could outsmart her wit, wisdom and intelligence.\n\nMany scholars took up her challenge, but she could not be defeated. That is until one day a man selling firewood arrived. He started shouting on top of his voice outside her door. Irritated with his shouting, Vidhyulatha asked the man to sell her his firewood.\n\nThe man said he would sell her his firewood in exchange for a ‘handful grain.’ She agreed and asked him to put the firewood in the backyard. However, the man insisted that she had not understood what he had actually asked for. He then said that if she couldn’t pay him the exact price of a ‘handful grain’, then she must take down her challenge board and give him 1000 gold coins.\n\nGetting angry, Vidhyulatha accused him of talking nonsense. The vendor said it was not nonsense, and since she had not understood his price, she should concede defeat. Hearing these words, Vidhyulatha started getting frustrated with the vendor. After hours of arguing, they decided to go to the provincial court.\n\nThe judge heard what Vidhyulatha had to say and then asked the firewood vendor to give his explanation. The vendor explained that he wanted a ‘handful grain’ which means a singular grain that would fill a hand. Since she failed to understand this, Vidhyulatha was bested and therefore she needed to take down her board and give the vendor the 1000 gold coins.\n\nImpressed, the judge agreed, and the matter was resolved. After Vidhyulatha took down her board, she asked the vendor who he really was, doubting a simple firewood vendor could have bested her. Taking off his disguise, Tenali Raman revealed himself! He wanted to teach the arrogant and snobbish Vidhyulatha a lesson in being humble. Lesson learned!",
      "story_name": "Handful of grain and coins",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ftenali%2Fgrain_coins.jpeg?alt=media&token=8bf2bbeb-b0ce-407b-b723-58cc2a0d2363"
    },
    {
      "story_title": "Happiness now",
      "story_description": "One day Tenali Rama and his friend were lying on a hammock and enjoying the gentle sea breeze. It was a beautiful day, and both men were smiling to themselves. Seeing his friend, Tenali inquired as to what was causing him to smile. His friend replied saying he was thinking about the day when he will be truly happy.\n\n“When is that?” Tenali Rama asked. His friend went on to explain that he will truly feel happy when he has a house by the sea, with a comfortable car, a big bank balance, a pretty wife and four sons who would get educated and earn a lot of money.\n\nInterrupting this monologue, Tenali asked, “After all this, what will you do?” To which his friend replies “After all this, I can put my feet up, enjoy the sea breeze and the sun on my face.” Hearing this, Tenali gives out a mighty laugh and says “But aren’t you doing just that now? Minus all the hard work!”",
      "story_name": "Happiness now",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ftenali%2Fhammock.jpeg?alt=media&token=19e68bb0-62ed-482e-bee1-c2b30f0f3895"
    },
    {
      "story_title": "The Cursed Man or King?",
      "story_description": "In the Kingdom of Vijayanagara, there lived a man named Ramaya. The rumour was that if one saw Ramaya in the morning, they would be cursed and not be able to eat the whole day. Hearing this, the King wanted to test it out for himself.\n\nThe guards made the arrangements for Ramaya and set up a room right next to the King for him. The next morning, the King walked to Ramaya’s room, so he could look at him first thing and test this rumour out.\n\nIt just so happened that at lunchtime, the King spotted a fly in his meal and asked the cook to take it away and prepare a new lunch. By the time lunch was served again, the King had lost his appetite and realised that this rumour was indeed true – seeing Ramaya’s face first thing in the morning did cause people to be cursed. He didn’t wish this for his people and demanded that Ramaya be hanged.\n\nDistraught, Ramaya’s wife goes to Tenali Raman for help as she doesn’t want to lose her husband. Hearing the whole story, Tenali Raman goes to Ramaya and whispers something into his ear, right before he is to be taken to be hanged.\n\nOn the same day, the guards ask Ramaya if he has any last wishes. Ramaya says he wants to give the King a note that he must read before the hanging. The guards deliver this note to the King. In the note were the words Tenali Raman had whispered – ‘If seeing Ramaya’s face, one loses their appetite; then a person who sees the King’s face, first thing in the morning, is destined to lose his life. Who is, therefore, more cursed – Ramaya or the King?’\n\nReading this, the King understood his mistake and set Ramaya free!",
      "story_name": "The Cursed Man or King?",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ftenali%2Fsoup.png?alt=media&token=eb2736cb-f906-48c0-af5a-07ce95f417d6"
    },
    {
      "story_title": "The Uncovered Face",
      "story_description": "In the King’s court, there was a very orthodox teacher named Tathacharya who belonged to the Vaishnavite sect. He looked down on other people, especially the Smarthas – covering his face with a cloth whenever he saw people from this and other sects.\n\nFed up of this behaviour, the King and other courtiers went to Tenali Raman for his help. After listening to everyone’s complaints about the royal teacher, Tenali Raman went to Tathacharya’s house. Upon seeing Tenali, the teacher covered his face. Seeing this, Tenali asked him why he did that. He explained that Smarthas were sinners and to look upon the face of a sinner meant that he would be turned into a donkey in his next life. That’s when an idea struck Tenali!\n\nOne day, Tenali, the King, Tathacharya and the other courtiers went on a picnic together. As they were returning from their picnic, Tenali spotted some donkeys. He immediately ran up to them and started saluting them. Puzzled, the King asked Tenali why he was saluting the donkeys. Tenali then explained that he was paying his respects to Tathacharya’s ancestors, who had become donkeys after looking at the faces of Smarthas.\n\nTathacharya understood Tenali’s harmless behaviour, and from that day forward, never covered his face again.",
      "story_name": "The Uncovered Face",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ftenali%2Fdonkey.jpeg?alt=media&token=20726b16-b550-42ba-ba94-7e345c5244c0"
    },
    {
      "story_title": "Raman the detective",
      "story_description": "Tenali Raman was once walking along a forest path when he was stopped by a merchant. “I’m looking for my camel which has strayed away. Did you see it passing by?” asked the merchant.\n\n“Had the camel hurt its leg?” asked Raman.\n“Oh yes! That means you have seen my camel!” said the merchant.\n“Only its footprints. See, you can see footprints of an animal with three legs,” said Raman, pointing out the footprints on the ground. “It was dragging the other leg because it was hurt in that leg.”\n\n“Was it blind in one eye?” Raman asked the merchant.\n“Yes, yes,” said the merchant eagerly.\n“Was it loaded it with wheat on one side and sugar on the other side?” asked Raman.\n“Yes, you are right,” said the merchant.\n“So you have seen my camel!” exclaimed the merchant.\nRaman looked upset. “Did I say I saw your camel?”\n“You have given the exact description of my camel,” said the merchant.\n“I saw no camel,” said Raman.\n“Do you see those plants lined up on both sides of this path? You can clearly see, some animal has eaten leaves of plants on the left, but the plants on the other side remain untouched. So the animal could see with only one eye.\n“Look down. You can see ants lined up on this side which means, the animal was loaded with sugar bag on this side. The bag had a hole, which allowed the sugar to fall off.”\n\n“You can see grains of wheat fallen on the other side. The bag on this side also must have holes in it,” said Raman.\n“I can see everything you showed me,” protested the merchant,”but I still don’t see my camel.”\n“You follow this trail and soon you will catch up with your animal. After all it is hurt in one leg and you seem to be hale and hearty,” said Raman.\nThe merchant took his advice and followed the trail left by the camel.\nSoon he caught up with the poor animal, limping along.\n“Rani!” the merchant shouted in happiness, as he ran to his camel.",
      "story_name": "Raman the detective",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ftenali%2Fcomic.jpeg?alt=media&token=a9633787-1c42-4afc-90d9-34690d9aa469"
    },
    {
      "story_title": "The Clever Thief",
      "story_description": "Once upon a time, Raman set out on a long journey. In those days, one had to walk through the jungle to get to another city. On the way, another traveler joined Raman. “This place is infested with thieves. I am afraid they will rob me. Can I travel with you?” the man asked Raman. Raman readily agreed.\nThat night, the two of them stopped at some place to rest. Raman was tired and fell asleep soon. His companion was waiting for this moment. In fact, he was a thief who used to rob travelers. He got up and looked under Raman’s pillow without disturbing him. He found nothing. He carefully searched Raman’s pockets looking for money. To his disappointment, he did not find even a paisa! Then he opened the bundle Raman was carrying. Again, he found nothing.\nThe next morning, the two resumed their journey. They halted for the night. Raman had a sound sleep. His companion searched Raman’s belongings, looking for money and valuables. Again, he was disappointed.\nThe next day, the two travelers reached the holy city of Tirupati, and they had to part company. The companion confessed that he was a thief. “ I have never met with failure. But this time I failed. Now that we are parting company, please tell me where did you hide the money in the night?” pleaded the thief. “Unless I know your secret, I may not be able to sleep,” he confessed.\nRaman smiled, “I knew you were a thief the moment I saw you. I took care to hide money where you would never find it.”\n“But where? I looked for it everywhere,” cried out the thief.\n“Did you look for it under your pillow?” asked Raman.\n“I looked for it under your pillow and found nothing. Why should I look for your money under my pillow?” asked the bewildered thief.\n“Because I hid the money under your pillow,” said Raman, “I was confident it was the one place you would never look for my money.”",
      "story_name": "The Clever Thief",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ftenali%2Ftirupati.jpeg?alt=media&token=f9281d7a-c4c1-40a9-be63-f8ea6c288689"
    },
    {
      "story_title": "The Horse Race",
      "story_description": "An Arab brought a shipload of horses from Persia. Many in the court of king Krishnadevaraya bought the horses from the Arab. Raman maintained that Vijayanagara’s horses were superior to the horses from Arabia. The ministers who bought the Arabian horses challenged Raman to prove this point in a horse race.\nThe courtiers put in much effort to train their horses. They fed the horses well to make sure they were strong and sturdy.\nOn the day of the race, all the courtiers brought their well-fed horses to a field. They had employed well-trained jockeys to ride the horses.\nRaman brought his horse which looked lean and thin. He had a hungry look, as though he had not eaten for days. Raman announced that he himself would ride his horse.\nAll the horses were lined up with the jockeys in position. Raman sat on the hungry looking horse. He had a long pole in his hand. He had tied a bundle of grass to one end of the stick. Holding the stick from the other end, Raman dangled the grass in front of the horse. The horse wanted to grab the food. So, he ran fast. But no matter how fast he ran, the grass remained outside his reach.\nThe horse kept running with greater speed until it crossed the finish line, coming first in the race. Raman hugged his horse and fed it lush green grass. When Raman went to collect the prize, the king asked him the secret of his success. “One must have hunger for success, Maharaj,” Raman said, “only then will one succeed.”",
      "story_name": "The Horse Race",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ftenali%2Fhorsey.jpeg?alt=media&token=58c86828-42f5-464e-a166-5af58dbc7fcb"
    },
    {
      "story_title": "Raman and the cat",
      "story_description": "The intelligence of animals was being discussed in the court of king Krishnadevaraya. “Cats are most intelligent,” said one minister. Others in the court agreed with the minister. They started describing how clever their own cats were. Each one claimed his own cat was the smartest.\nThe king wanted to hold a competition for cats. “The cat that does something which no other cat can do will be declared the winner,” announced the king.\nThe following week, the courtiers came with their cats. Raman of Tenali also brought his cat to the court. The king wanted to give a treat to the cats first. Milk was served to the cats in golden plates.\nThe moment they saw the milk, all cats rushed towards it. Only one cat ran in the opposite direction—away from the milk. The king was surprised to see this strange behavior. Raman said with a smile, “Maharaj, all cats ran towards milk. My cat ran away from milk. My cat has done what no other cat has done.” Krishnadevaraya agreed and declared Raman’s cat as the winner.\nWhen Raman came to collect the prize, the king asked him how he trained his cat to do what no other cat could do. Raman smiled. “I wanted to make sure that my cat gets the best milk. So, I boiled the milk and poured it in a plate to cool it. The moment he saw milk, my cat came running to lap it up. Before I could stop him, he had the first lick and burnt his tongue. Since that day, whenever he sees milk in a plate he runs away.”\nThe king and Raman had a hearty laugh.",
      "story_name": "Raman the cat",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ftenali%2Fcats.jpeg?alt=media&token=05b5ecd7-abd3-43e1-9da4-659008c3d642"
    },
    {
      "story_title": "The Weight of a Hill",
      "story_description": "Tenali Raman and his wife were on their way to Hampi, the capital of Vijayanagara. On the way, they passed through a village at the foot of a hill. The villagers had gathered in front of the village temple. Raman’s wife became curious and dragged her husband to the spot. Husband and wife pushed through the crowd to appear in the front row.\nA body builder was exhibiting his strength. He was seen carrying a huge gunny bag on his left shoulder, and twirling his moustache with his right hand.\n“He is carrying a bag of 500 quintals of rice,” said the man standing next to Raman.\n“This is nothing. I can carry a thousand times more weight,” said Raman in a loud voice.\nStartled by this announcement, the body builder dropped the bag he was carrying. Everybody looked at Raman wondering whether a new champion had arrived.\nEnjoying the attention, Raman addressed the crowd. “Why, I can carry that hill on my bare shoulder,” he said, pointing out the hill nearby.\nThe villagers gaped at him. Raman’s wife appeared tense. She had a suspicion that her husband had opened his mouth too wide.\nMeanwhile the body builder had recovered his wit. He laughed out aloud and said, “Is that so? Let’s see you do it.”\nThe villagers were now excited. They had seen only Hanumanji carrying the Sanjeevani mountain—and that too in pictures. Now here was a man who claimed he could repeat the feat.\n“I said I can do it. Did I say I’ll do it now?” asked Raman. “Carrying a hill requires a lot of preparation,” Raman added.\nTurning to the weight lifter, Raman asked, “How long did you take to prepare for this feat of carrying the sack of rice?”\n“Three months,” confessed the weight lifter.\n“How long will you take?” the Village Chief asked Raman.\n“Six months,” said Raman without batting an eye.\nThen Raman added. “I need to eat enormous amount of food to build my muscles. And I need someone to massage my body, daily.”\n“And we need a place to live. We are outsiders,” said Raman’s wife.\nThe village chief agreed to provide the couple with a house and arrange the food supply. He directed the weight lifter to give Raman body massage daily.\n“And we will meet here, exactly six months from now,” said the village chief getting up from the chair.\nRaman’s wife was relieved. They did not have to wonder where the food would come from. For the next six months, at least.\nRaman led a royal life in the village. Villagers supplied pots of milk, honey and curd. Cartloads of rice and ragi were delivered to their house. The body builder was available to cook food, and also give body massage to Raman every day.\nThe body builder who had become a Raman disciple by now asked Raman about the practice. “Would you like to begin with a small rock, then move on to bigger and bigger rocks?” he asked. Raman sent him away asking him to make ragi mudde (balls of steamed ragi flour).\nSoon it was the D-day. The whole village assembled at the foot of the hill. Raman and his wife arrived in a decorated cart pulled by the body builder. The villagers received the weight lifter, Raman with a shout of joy.\nThe village chief gave a sign that the show could begin.\nRaman stood in a circle with people seated all round. He sat in the warrior’s pose, Veeramudra, and announced he was ready.\nThe villagers were puzzled. The village chief became impatient. “What are you waiting for?” he barked.\n“I’m waiting for your men to place the hill on my shoulder,” said Raman calmly.\nEverybody gaped at Raman. The village chief shouted in anger “You said … “\nRaman cut him short, “I said I will carry that hill. Even now I’m willing to carry the hill. I’m waiting for your men to place it on my shoulder.”\n“But who will lift the hill?” asked the Village Chief in bewilderment.\n“That’s your problem,” Raman said.\n“Only Hanumanji can lift it,” said Raman’s wife.\nThe village chief joined his hands in salutation to Raman. “A man of your strength and determination should carry not a lowly hill, but Mount Kailas.” The villagers started laughing.\nWhen they got back home, Raman asked his wife to pack, “We are leaving this village,” he said.",
      "story_name": "The Weight of a Hill",
      "story_image": "https://firebasestorage.googleapis.com/v0/b/story-a6e84.appspot.com/o/images_v1%2Ftenali%2Fhill.jpeg?alt=media&token=ca53cdcb-812a-41c5-acd6-0bd32d771a96"
    }
  ]
}